alibaba/AliOS-Things/components/py_engine/adapter/esp32/boards/GENERIC/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "ESP32 module"
#define MICROPY_HW_MCU_NAME "ESP32"
#define MICROPY_SW_VENDOR_NAME "HaaSPython"
